---
kind: property
id: P:Autodesk.Revit.DB.CompoundStructure.IsEmpty
source: html/83b951b2-dadd-ac46-82e6-40003a29403e.htm
---
# Autodesk.Revit.DB.CompoundStructure.IsEmpty Property

Checks whether this CompoundStructure is empty.

## Syntax (C#)
```csharp
public bool IsEmpty { get; }
```